In [4]:
import pandas as pd

## DataFrame

In [5]:
forum_users = {
    'User ID': [1, 2, 3, 4, 5],
    'Username': ['name_1', 'name_2', 'name_3', 'name_4', 'name_5'],
    'Age': [18, 35, 25, 38, None],
    'Joined Date': pd.to_datetime(['2032-01-01', '2032-02-15', '2032-04-25', '2032-05-21', '2032-09-15']),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1   name_1  18.0  2032-01-01          150         500
1        2   name_2  35.0  2032-02-15          230         720
2        3   name_3  25.0  2032-04-25           80         200
3        4   name_4  38.0  2032-05-21          420         940
4        5   name_5   NaN  2032-09-15          310         500

In [6]:
df.shape

(5, 6)

In [7]:
df.columns

Index(['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts',
       'Reputation'],
      dtype='object')

In [8]:
df.columns.tolist()

['User ID', 'Username', 'Age', 'Joined Date', 'Total Posts', 'Reputation']

In [9]:
df.index.tolist()

[0, 1, 2, 3, 4]

In [10]:
df.dtypes

User ID                 int64
Username               object
Age                   float64
Joined Date    datetime64[ns]
Total Posts             int64
Reputation              int64
dtype: object

In [11]:
df.values

array([[1, 'name_1', 18.0, Timestamp('2032-01-01 00:00:00'), 150, 500],
       [2, 'name_2', 35.0, Timestamp('2032-02-15 00:00:00'), 230, 720],
       [3, 'name_3', 25.0, Timestamp('2032-04-25 00:00:00'), 80, 200],
       [4, 'name_4', 38.0, Timestamp('2032-05-21 00:00:00'), 420, 940],
       [5, 'name_5', nan, Timestamp('2032-09-15 00:00:00'), 310, 500]],
      dtype=object)

In [12]:
df.head(3)

   User ID Username   Age Joined Date  Total Posts  Reputation
0        1   name_1  18.0  2032-01-01          150         500
1        2   name_2  35.0  2032-02-15          230         720
2        3   name_3  25.0  2032-04-25           80         200

In [13]:
df.tail(2)

   User ID Username   Age Joined Date  Total Posts  Reputation
3        4   name_4  38.0  2032-05-21          420         940
4        5   name_5   NaN  2032-09-15          310         500

In [14]:
df.describe().round(2)

       User ID    Age          Joined Date  Total Posts  Reputation
count     5.00   4.00                    5          5.0        5.00
mean      3.00  29.00  2032-04-21 19:12:00        238.0      572.00
min       1.00  18.00  2032-01-01 00:00:00         80.0      200.00
25%       2.00  23.25  2032-02-15 00:00:00        150.0      500.00
50%       3.00  30.00  2032-04-25 00:00:00        230.0      500.00
75%       4.00  35.75  2032-05-21 00:00:00        310.0      720.00
max       5.00  38.00  2032-09-15 00:00:00        420.0      940.00
std       1.58   9.20                  NaN        133.3      276.62

In [15]:
df.select_dtypes(include='object')

  Username
0   name_1
1   name_2
2   name_3
3   name_4
4   name_5

In [16]:
df.select_dtypes(include='object').columns

Index(['Username'], dtype='object')

In [17]:
df.select_dtypes(include='int')

   User ID  Total Posts  Reputation
0        1          150         500
1        2          230         720
2        3           80         200
3        4          420         940
4        5          310         500

In [18]:
df.isna()

   User ID  Username    Age  Joined Date  Total Posts  Reputation
0    False     False  False        False        False       False
1    False     False  False        False        False       False
2    False     False  False        False        False       False
3    False     False  False        False        False       False
4    False     False   True        False        False       False

In [19]:
df.isna().sum()

User ID        0
Username       0
Age            1
Joined Date    0
Total Posts    0
Reputation     0
dtype: int64

## Series

In [22]:
username_series = df['Username']
username_series

0    name_1
1    name_2
2    name_3
3    name_4
4    name_5
Name: Username, dtype: object

In [23]:
type(username_series)

pandas.core.series.Series

In [24]:
username_series.values

array(['name_1', 'name_2', 'name_3', 'name_4', 'name_5'], dtype=object)

In [25]:
type(username_series.values)

numpy.ndarray

In [26]:
username_series.index

RangeIndex(start=0, stop=5, step=1)

In [27]:
username_series.value_counts()

Username
name_1    1
name_2    1
name_3    1
name_4    1
name_5    1
Name: count, dtype: int64

In [28]:
df['Reputation'].value_counts()

Reputation
500    2
720    1
200    1
940    1
Name: count, dtype: int64

In [29]:
df['Reputation'].value_counts(ascending=True)

Reputation
720    1
200    1
940    1
500    2
Name: count, dtype: int64

In [30]:
df['Reputation'].unique()

array([500, 720, 200, 940], dtype=int64)

In [32]:
df['Username'].sort_values(ascending=False)

4    name_5
3    name_4
2    name_3
1    name_2
0    name_1
Name: Username, dtype: object

In [33]:
df['Username'].sort_values()

0    name_1
1    name_2
2    name_3
3    name_4
4    name_5
Name: Username, dtype: object